tomasmcguinness/matter-esp32-mbus-adapter/firmware/sdkconfig.defaults.esp32c6
# ESP32-C6 settings common to every radio configuration.
#
# This file is deliberately radio-neutral: it selects neither Thread nor Wi-Fi.
# A build must name one of the radio overlays explicitly, e.g.
#
#   idf.py -B build.thread -DSDKCONFIG=sdkconfig.thread \
#     -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.thread" build
#
# IDF appends "<file>.esp32c6" for each entry in SDKCONFIG_DEFAULTS, so this
# file is still picked up automatically; only the radio has to be named.

CONFIG_IDF_TARGET="esp32c6"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE (BLE used for commissioning only)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

CONFIG_LWIP_MULTICAST_PING=y

# mDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable chip shell for debugging
CONFIG_ENABLE_CHIP_SHELL=y
